; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	image3 - mode
	thermograph0 - mode
	infrared1 - mode
	Star0 - direction
	Star3 - direction
	Star4 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	Star12 - direction
	GroundStation15 - direction
	Star17 - direction
	GroundStation18 - direction
	GroundStation10 - direction
	Star13 - direction
	GroundStation2 - direction
	Star16 - direction
	Star19 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star14 - direction
	Star11 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
	Star22 - direction
	Planet23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
	Star26 - direction
	Planet27 - direction
	Planet28 - direction
	Phenomenon29 - direction
	Phenomenon30 - direction
	Planet31 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star16)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star16)
	(supports instrument2 infrared2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star16)
	(calibration_target instrument2 Star19)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star13)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star19)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite0 Star11)
	(have_image Phenomenon20 thermograph0)
	(have_image Phenomenon21 thermograph0)
	(have_image Star22 infrared1)
	(have_image Planet23 image3)
	(have_image Phenomenon24 infrared2)
	(have_image Phenomenon25 image3)
	(have_image Star26 infrared2)
	(have_image Planet27 infrared1)
	(have_image Planet28 infrared1)
	(have_image Phenomenon29 thermograph0)
	(have_image Phenomenon30 infrared2)
	(have_image Planet31 infrared1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
2. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 13
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
4. (turn_to satellite1 phenomenon20 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon20)
   goals met: 0 of 13
5. (take_image satellite1 phenomenon20 instrument3 thermograph0)
   added: (have_image phenomenon20 thermograph0)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon21 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 phenomenon21)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon21 instrument3 thermograph0)
   added: (have_image phenomenon21 thermograph0)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon29 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon29)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon29 instrument3 thermograph0)
   added: (have_image phenomenon29 thermograph0)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon24 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon24)
   goals met: 3 of 13
11. (turn_to satellite0 star16 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 star16)
   goals met: 3 of 13
12. (calibrate satellite0 instrument0 star16)
   added: (calibrated instrument0)
   goals met: 3 of 13
13. (turn_to satellite0 phenomenon24 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 phenomenon24)
   goals met: 3 of 13
14. (take_image satellite0 phenomenon24 instrument0 infrared2)
   added: (have_image phenomenon24 infrared2)
   goals met: 4 of 13
15. (turn_to satellite0 phenomenon25 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon25)
   goals met: 4 of 13
16. (take_image satellite0 phenomenon25 instrument0 image3)
   added: (have_image phenomenon25 image3)
   goals met: 5 of 13
17. (turn_to satellite0 phenomenon30 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon30)
   goals met: 5 of 13
18. (take_image satellite0 phenomenon30 instrument0 infrared2)
   added: (have_image phenomenon30 infrared2)
   goals met: 6 of 13
19. (turn_to satellite0 planet23 phenomenon30)
   deleted: (pointing satellite0 phenomenon30)
   added: (pointing satellite0 planet23)
   goals met: 6 of 13
20. (take_image satellite0 planet23 instrument0 image3)
   added: (have_image planet23 image3)
   goals met: 7 of 13
21. (turn_to satellite0 planet27 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet27)
   goals met: 7 of 13
22. (take_image satellite0 planet27 instrument0 infrared1)
   added: (have_image planet27 infrared1)
   goals met: 8 of 13
23. (turn_to satellite0 planet28 planet27)
   deleted: (pointing satellite0 planet27)
   added: (pointing satellite0 planet28)
   goals met: 8 of 13
24. (take_image satellite0 planet28 instrument0 infrared1)
   added: (have_image planet28 infrared1)
   goals met: 9 of 13
25. (turn_to satellite0 planet31 planet28)
   deleted: (pointing satellite0 planet28)
   added: (pointing satellite0 planet31)
   goals met: 9 of 13
26. (take_image satellite0 planet31 instrument0 infrared1)
   added: (have_image planet31 infrared1)
   goals met: 10 of 13
27. (turn_to satellite0 star11 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 star11)
   goals met: 11 of 13
28. (turn_to satellite0 star22 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star22)
   goals met: 10 of 13
29. (take_image satellite0 star22 instrument0 infrared1)
   added: (have_image star22 infrared1)
   goals met: 11 of 13
30. (turn_to satellite0 star11 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 star11)
   goals met: 12 of 13
31. (turn_to satellite0 star26 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star26)
   goals met: 11 of 13
32. (take_image satellite0 star26 instrument0 infrared2)
   added: (have_image star26 infrared2)
   goals met: 12 of 13
33. (turn_to satellite0 star11 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star11)
   goals met: 13 of 13
